rails_site/app/controllers/checkins_controller.rb

INSERT INTO `checkins` (`device_id`, `uptime`, `created_at`, `updated_at`, `method`, `passkey`, `ip`) VALUES(1, 0, '2010-06-20 06:47:06', '2010-06-20 06:47:06', 'manual', '', '0.0.0.0')
INSERT INTO `devices` (`name`, `created_at`, `updated_at`) VALUES('phone', '2010-06-20 06:47:06', '2010-06-20 06:47:06')
SELECT * FROM `devices` WHERE (`devices`.`name` = 'phone') LIMIT 1
---
  def checkin
    checkin = Checkin.new
    checkin.device = Device.find_or_create_by_name_and_passkey params[:name], params[:passkey]

SELECT * FROM `devices`
---
  def list
    @devices = Device.find :all