rails_site/app/controllers/users_controller.rb

UPDATE `users` SET `login` = 'robert', `email` = 'robert@robertcarpenter.net', `crypted_password` = '0163fe6dbf1555fe80a2dd8cc9c04ff967bcbb2d', `updated_at` = '2010-06-12 02:41:11' WHERE `id` = 1
INSERT INTO `users` (`login`, `email`, `crypted_password`, `salt`, `created_at`, `updated_at`, `last_accessed_at`, `remember_token`, `remember_token_expires_at`, `is_admin`, `is_guest`) VALUES(NULL, NULL, NULL, NULL, '2010-06-12 02:41:11', '2010-06-12 02:41:11', NULL, NULL, NULL, 0, 1)
---
  def create
		# robert: no clue what this does
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session

		#if we already have a user, and it is a guest account, import the form fields
		if current_user and current_user.is_guest?
			current_user.update_attributes params[:user]
			current_user.is_guest = false
			@user = current_user
		#if the current user is not a guest and is still trying to register
		elsif current_user and !current_user.is_guest?
			logger.info "current_user is not guest"
		#if there is no current user...
		else
			@user = User.new(params[:user])
		end
    cookies.delete :auth_token
    @user.save