app/controllers/content_controller.rb

SELECT * FROM `content` WHERE (`content`.`id` = '--- :id\n')
---
  def show
    @content = Content.find params[:id]

SELECT * FROM `content` WHERE (`content`.`id` = 77) LIMIT 1
---
  def last
    @content = Content.find :last

SELECT * FROM `content`
---
  def index
    content = Content.find :all