app/controllers/ip_controller.rb

  def index
    @ip = request.remote_ip
    if @ip == '' then
      @ip = nil
    else
      ip = IpAddress.find_or_create_by_address @ip
      ip.count += 1
      ip.save
---
INSERT INTO `ip_addresses` (`address`, `created_at`, `updated_at`, `count`) VALUES(NULL, '2010-06-12 17:43:36', '2010-06-12 17:43:36', 0)
SELECT * FROM `ip_addresses` WHERE (`ip_addresses`.`address` IS NULL) LIMIT 1
UPDATE `ip_addresses` SET `count` = 1, `updated_at` = '2010-06-12 17:43:36' WHERE `id` = 1

  def list
    @ips = IpAddress.find :all
---
SELECT * FROM `ip_addresses`