app/controllers/writings_controller.rb

SELECT * FROM `writings` WHERE (`writings`.`id` = 77)
---
  def show
    @writing = nil
    if !params[:id].nil?
      #flash[:style] = "searching by id"
      @writing = Writing.find params[:id]

SELECT * FROM `writings` WHERE (`writings`.`id` = 77) LIMIT 1
---
  def last
    @writing = Writing.find_by_id 77

SELECT * FROM `writings`
---
  def index
    #organize content by year, then month
    writings = Writing.find :all

SELECT * FROM `writings` WHERE (`writings`.`id` = 77)
---
  def edit
    @writing = Writing.find params[:id]

SELECT * FROM `writings` WHERE (`writings`.`id` = 77)
UPDATE `writings` SET `linkText` = 'about_', `date` = '2008-01-02 00:21:07', `updated_at` = '2010-06-12 20:46:18' WHERE `id` = 77
---
  def update
    @writing = Writing.find params[:id]
    if @writing.update_attributes params[:writing] then